Repository: sssslu/CarRentService
Catalog: lib/l10n/app_*.arb
Languages: ko, sq

# carList
source: Vehicle List
ko: 차량 목록
sq: Lista e Automjeteve

# rentGuide
source: How to Rent
ko: 대여 방법
sq: Si të Merrni me Qira

source: Location
ko: 찾아오시는 길
sq: Vendndodhja

# about
source: About Us
ko: 사업 소개
sq: Rreth Nesh

source: Language
ko: 언어
sq: Gjuha

# rentStep0Title
source: 0. Scan QR Code
ko: 0. QR 코드 촬영
sq: 0. Skanoni Kodin QR

# rentStep0Desc
source: Check vehicle info using a QR code.
ko: QR Code 로 원하는 차량 정보를 확인하세요.
sq: Shikoni informacionin për automjetin përmes kodit QR.

# rentStep1Title
source: 1. Visit Rental Location
ko: 1. 대여소 방문
sq: 1. Vizitoni Agjencinë e Qirasë

# rentStep1Desc
source: Visit the rental site and consult with staff. ID and license verification is required before choosing a vehicle.
ko: 현지 대여소에서 직원의 안내를 받으세요. 신분증 및 면허증 확인 후 차량 선택이 가능합니다.
sq: Vizitoni vendndodhjen dhe konsultohuni me stafin. Nevojitet verifikim i ID-së dhe patentës përpara përzgjedhjes së automjetit.

# rentStep2Title
source: 2. Fill Out Contract
ko: 2. 계약서 작성
sq: 2. Plotësoni Kontratën

# rentStep2Desc
source: Fill out a simple rental agreement. Insurance options can be selected here.
ko: 간단한 계약서를 작성합니다. 보험 옵션도 이 단계에서 선택 가능합니다.
sq: Plotësoni një kontratë të thjeshtë qiraje. Opsionet e sigurimit mund të zgjidhen këtu.

# rentStep3Title
source: 3. Vehicle Handover & Safety Briefing
ko: 3. 차량 인수 및 주의사항 안내
sq: 3. Dorëzimi i Mjetit dhe Udhëzimet

# rentStep3Desc
source: Check the vehicle exterior and fuel level. Listen to instructions for safe use.
ko: 차량 외관과 연료 상태를 확인하고, 사용 시 주의사항에 대해 안내받습니다.
sq: Kontrolloni gjendjen e jashtme dhe nivelin e karburantit. Merrni udhëzime për përdorim të sigurt.

source: Open in Google Maps
ko: Google Map에서 열기
sq: Hape në Google Maps

# locationDirections
source: From the airport, walk 100m left → Opposite the bus terminal Turn right at the alley next to the red sign → Walk 50m 1st floor of the building on the right - Car Rent Service sign
ko: 공항 도착 후 좌측으로 100m 이동 → 버스터미널 맞은편 빨간 간판 옆 골목으로 우회전 후 직진 50m 오른편 건물 1층 Car Rent Service 간판
sq: Nga aeroporti ecni 100m majtas → Përballë terminalit të autobusëve Kthehuni djathtas tek rruga ngjitur me tabelën e kuqe → Ecni 50m Kati i parë i ndërtesës në të djathtë - tabela Car Rent Service

# aboutDescription
source: We are a car rental service based in Tirana, Albania. You can easily check and rent vehicles at our local branch, and we plan to offer online reservation via app in the future.
ko: 저희는 알바니아 티라나 지역을 기반으로 한 차량 대여 서비스입니다. 현지 오프라인 대여소에서 간편하게 차량을 확인하고 계약할 수 있으며,차후 앱을 통한 온라인 예약 기능도 제공할 예정입니다.
sq: Ne jemi një shërbim me qira makinash me bazë në Tiranë, Shqipëri. Mund të kontrolloni dhe merrni me qira automjete në degën tonë lokale, dhe së shpejti do të ofrojmë rezervime online përmes aplikacionit.

# aboutContactBranch
source: Contact Local Branch
ko: 대여소 바로 연락하기
sq: Kontakto Degën Lokale

# aboutAdminSystem
source: Admin Vehicle Management System
ko: 관리자 차량 등록 시스템
sq: Sistemi i Regjistrimit të Automjeteve për Administratorët
